// 1 オリジン
// ステートレス (オブジェクト指向は使わないつもり)

const neighbor = (x, y) => {
  return [
    [x-1,y-1],[x,y-1],[x+1,y-1],
    [x-1,y],          [x+1,y],
    [x-1,y+1],[x,y+1],[x+1,y+1]
  ]
}

const notice = (x, y) => {
  const res = {}
  const lifes = neighbor(x,y)
  lifes.map(it => {res[it] = 1})

  return res
}

//TODO: これをリファクタリングするところから
const notice2 = (xy) => notice(xy[0], xy[1])

const noticeAll = (lifes) => {
  const temp = lifes.map(it => notice2(it))
  console.log(temp)
  return {
              [[1,0]]:1,[[2,0]]:1,[[3,0]]:1,
    [[0,1]]:1,[[1,1]]:2,[[2,1]]:1,[[3,1]]:1,
    [[0,2]]:1,[[1,2]]:1,[[2,2]]:2,[[3,2]]:1,
    [[0,3]]:1,[[1,3]]:1,[[2,3]]:1
  }
}

describe('初期処理ができること', () => {
})
describe('活性、不活性の状態変更ができること', () => {
  it.todo('座標を指定したら、活性すること')
})
describe('八近傍に活性通知のインクリメントができること', () => {
  it('1-2 の八近傍の座標を取得できること', () => {
    const exp = [
      [0,1],[1,1],[2,1],
      [0,2],      [2,2],
      [0,3],[1,3],[2,3]
    ]
    expect(neighbor(1,2)).toEqual(exp)
  })
  it('2-1 の八近傍の座標を取得できること', () => {
    const exp = [
      [1,0],[2,0],[3,0],
      [1,1],      [3,1],
      [1,2],[2,2],[3,2]
    ]
    expect(neighbor(2,1)).toEqual(exp)
  })
  it('2-1 の八近傍に生存通知ができること', () => {
    const exp = {
      [[1,0]]:1,[[2,0]]:1,[[3,0]]:1,
      [[1,1]]:1,          [[3,1]]:1,
      [[1,2]]:1,[[2,2]]:1,[[3,2]]:1
    }
    expect(notice(2,1)).toEqual(exp)
  })
  it('1-2 の八近傍に生存通知ができること', () => {
    const exp = {
      [[0,1]]:1,[[1,1]]:1,[[2,1]]:1,
      [[0,2]]:1,          [[2,2]]:1,
      [[0,3]]:1,[[1,3]]:1,[[2,3]]:1
    }
    expect(notice(1,2)).toEqual(exp)
  })
  xit('1-2 の八近傍に生存通知ができること', () => {
    const exp = {
      [[0,1]]:1,[[1,1]]:1,[[2,1]]:1,
      [[0,2]]:1,          [[2,2]]:1,
      [[0,3]]:1,[[1,3]]:1,[[2,3]]:1
    }
    expect(noticeAll([[1,2]])).toEqual(exp)
  })
  it('1-2, 2-1 の八近傍に生存通知ができること', () => {
    const exp = {
                [[1,0]]:1,[[2,0]]:1,[[3,0]]:1,
      [[0,1]]:1,[[1,1]]:2,[[2,1]]:1,[[3,1]]:1,
      [[0,2]]:1,[[1,2]]:1,[[2,2]]:2,[[3,2]]:1,
      [[0,3]]:1,[[1,3]]:1,[[2,3]]:1
    }
    expect(noticeAll([[1,2],[2,1]])).toEqual(exp)
  })
})

describe('次世代の判定ができること', () => {
  it.todo('過疎')
  it.todo('生存')
  it.todo('誕生')
  it.todo('過密')
})
describe('出力できること', () => {
  it.todo('コンソールに出力できること')
})
